# Teste
    Neste teste vou usar duas bibliotecas do python.
       - Como podemos ver com o método do randInt, não é possível criar valores em cada local das variáveis da nossa tabela.
       - Vamos tentar agora com outra biblioteca chamada numpy

In [113]:
from random import randint as rd
import pandas as pd

tabela = pd.DataFrame(rd(1, 100), index='jefferson e Rayssa'.split(), columns=['c','d'])
tabela

            c   d
jefferson  79  79
e          79  79
Rayssa     79  79

In [190]:
from numpy.random import randn

tba = pd.DataFrame(randn(3, 3) , index='J E F E R'.split(), columns=' R A Y S A'.split())
tba

          R         A         Y
J -0.950382  0.912656 -0.395476
E  0.537982  0.767943 -1.280409
F  1.216975  0.413674  1.605644

In [154]:
tba["R"]

J    1.033996
E   -0.867845
F   -0.461852
Name: R, dtype: float64

In [155]:
tba[['R']]

          R
J  1.033996
E -0.867845
F -0.461852

### criando uma nova coluna.
    Podemos ver que estamos somando os valores de duas outras colunas e multiplicando por 100.
        -Detalhe importante, por enquato, neste modelo e método eu só consigo acessar as colunas, não as linhas.

In [191]:
tba['RAY e JEF'] = (tba['R'] + tba['Y'])
tba

          R         A         Y  RAY e JEF
J -0.950382  0.912656 -0.395476  -1.345859
E  0.537982  0.767943 -1.280409  -0.742427
F  1.216975  0.413674  1.605644   2.822619

In [192]:
tba['Rock Babinha'] = tba["R"]
tba['Cabeção'] = tba['A']
tba

          R         A         Y  RAY e JEF  Rock Babinha   Cabeção
J -0.950382  0.912656 -0.395476  -1.345859     -0.950382  0.912656
E  0.537982  0.767943 -1.280409  -0.742427      0.537982  0.767943
F  1.216975  0.413674  1.605644   2.822619      1.216975  0.413674

## Apagando colunas e linhas
    Usando o  axis. 
        Este axis pode ter dois valores, 0 ou 1.
        1 - Corresponde as colunas.
        0 - Corresponde as linhas.
        Posso uusar o comando del ou o comando Drop().

In [179]:
del tba['Cabeção']
tba

          R         A         Y  RAY e JEF  Rock Babinha
J  2.058578  0.964787 -0.046469   2.012108      2.058578
E -1.302259 -0.696762 -0.782070  -2.084330     -1.302259
F  0.373775 -0.862057 -0.523332  -0.149557      0.373775

## Recriaando as coluna.

### Recriando a coluna

In [193]:
tba['Cabeção'] = tba['A']*10
tba

          R         A         Y  RAY e JEF  Rock Babinha   Cabeção
J -0.950382  0.912656 -0.395476  -1.345859     -0.950382  9.126556
E  0.537982  0.767943 -1.280409  -0.742427      0.537982  7.679425
F  1.216975  0.413674  1.605644   2.822619      1.216975  4.136739

In [194]:
tba.drop('Cabeção', axis=1, inplace=True)
tba

          R         A         Y  RAY e JEF  Rock Babinha
J -0.950382  0.912656 -0.395476  -1.345859     -0.950382
E  0.537982  0.767943 -1.280409  -0.742427      0.537982
F  1.216975  0.413674  1.605644   2.822619      1.216975

In [195]:
# Apagabdo e deic=xando somente as colunas originais.
tba.drop('Rock Babinha', axis=1, inplace=True)
tba

          R         A         Y  RAY e JEF
J -0.950382  0.912656 -0.395476  -1.345859
E  0.537982  0.767943 -1.280409  -0.742427
F  1.216975  0.413674  1.605644   2.822619

### Acessando os índecies.
    O método usado é loc.
        Retorna somente valores selecionados pro mim.

In [209]:
tba.loc[['J', 'F'], ['R','Y']]

          R         Y
J -0.950382 -0.395476
F  1.216975  1.605644

### Com o método iloc.
    Esté um pouco diferente pois nos dar acesso aos índices.

In [213]:
tba.iloc[0,3]

-1.3458588511313547

In [217]:
tba

          R         A         Y
J -0.950382  0.912656 -0.395476
E  0.537982  0.767943 -1.280409
F  1.216975  0.413674  1.605644

### Vejamos agora como acessar cada índice.

In [218]:
#tba.drop('RAY e JEF', axis=1, inplace=True) # Aqui foi porque ativei o comando depois.
tba

          R         A         Y
J -0.950382  0.912656 -0.395476
E  0.537982  0.767943 -1.280409
F  1.216975  0.413674  1.605644

In [226]:
for x in range(3):
    for y in  range(3): 
        #print(tba[x][y]) # Assim o python não permite porque tba é um dataframe
        if x == y == 1:
            tba.iloc[x, y] = 'Jefferson'
        else:
            print(tba.iloc[x, y])

-0.9503824651236715
0.9126555870314543
-0.39547638600768326
0.5379821990837935
-1.2804094830793582
1.2169751969504052
0.413673899246279
1.6056440517317678

In [229]:
tba

          R          A         Y
J -0.950382   0.912656 -0.395476
E  0.537982  Jefferson -1.280409
F  1.216975   0.413674  1.605644

In [235]:
tba['R'] > 1

J    False
E    False
F     True
Name: R, dtype: bool

In [237]:
tba[tba['R'] > 1]

          R         A         Y
F  1.216975  0.413674  1.605644

In [242]:
tba[(tba['R'] > 1) & (tba['Y'] > 1)]

          R         A         Y
F  1.216975  0.413674  1.605644

In [244]:
tba[tba['Y'] < 1]

          R          A         Y
J -0.950382   0.912656 -0.395476
E  0.537982  Jefferson -1.280409

In [253]:
tba = pd.DataFrame(randn(5, 5) , index='J E F E R'.split(), columns=' R A Y S A'.split())
tba

          R         A         Y         S         A
J -0.169880  0.229317  0.594606  0.773517  0.103203
E -0.397806  0.128260  1.723761 -0.239980 -0.287344
F -0.206958  0.122193  0.827278 -1.226216 -0.728535
E  0.039884 -2.668997 -1.637060  1.025961 -0.130283
R -0.605290  0.532330  2.046807 -2.228501 -0.329516

In [255]:
tba > 1

       R      A      Y      S      A
J  False  False  False  False  False
E  False  False   True  False  False
F  False  False  False  False  False
E  False  False  False   True  False
R  False  False   True  False  False

In [257]:
tba[tba > 1]

    R   A         Y         S   A
J NaN NaN       NaN       NaN NaN
E NaN NaN  1.723761       NaN NaN
F NaN NaN       NaN       NaN NaN
E NaN NaN       NaN  1.025961 NaN
R NaN NaN  2.046807       NaN NaN

In [258]:
tba[tba < 1]

          R         A         Y         S         A
J -0.169880  0.229317  0.594606  0.773517  0.103203
E -0.397806  0.128260       NaN -0.239980 -0.287344
F -0.206958  0.122193  0.827278 -1.226216 -0.728535
E  0.039884 -2.668997 -1.637060       NaN -0.130283
R -0.605290  0.532330       NaN -2.228501 -0.329516